with faa1 as (
			--Выбрать все филиалы ДВ дивизиона(то есть всех его РРС)
			select
			faa1."Ссылка",
			faa1."Наименование" ,
			faa1."ПриписанК_Территории"
			from
			"DB_1"."S.faa1" as faa1
			where
			faa1."ПриписанК_Территории" in ( 
			'47449ffc-7ca8-11e5-a729-00155d03361b' /* РРС ДВ "Сахалин" */ , 
			'794dd148-409b-11e1-8064-001517c526f0' /* РРС ДВ "Благовещенск" */ ,
			'312873ac-708d-11e5-9610-00155d03361b' /* РРС ДВ "Хабаровск" */ ,
			'4979cede-2660-11e7-ab3b-00155d03330d' /* РРС ДВ "Камчатка" */, 
			'b80e971f-f028-11e2-80d0-00155d030b1f' /* РРС ДВ "Приморье" */, 
			'b10b3c28-f137-11e9-a20d-00155d03332b' /* РРС ДВ "Комсомольск" */ ,
			'894248bc-8246-11e2-92a8-00155d030b1f' /* РРС ДВ "Владивосток" */)
        	),
	zdaa1 as (
			--выгрузить таблицы системы поручений(задания и задания детализация)
			select
			zdaa1_."ID",
			zdaa1_."Автор",
			zdaa1_."Событие",
			zdaa1_."Период",
			zdaa1_."Филиал",
			zaa1_."ТипЗадания",
--можно добавить задания-документы, но тогда ID перестанет быть уникальным из-за их специфики
			--zaa1_doc."Документ",
			zaa1_."Документ",
			zdaa1_."ИсточникСобытия"
			from "DB_1"."RS.zdaa1" as zdaa1_
			inner join "DB_1"."RS.zaa1" as zaa1_ on
			zdaa1_."ID" = zaa1_."ID"
			/*left join "DB_1"."RS.zaa1Dokumenty" as zaa1_doc on
			zdaa1_."ID" = zaa1_doc."ID"*/
			where (
--ИЗМЕНЯТЬ ДАТУ ЗДЕСЬ			
					zdaa1_."Период" between '2023-04-01' and DATE(now()) /* DATE(:date2) */
					)
					and zdaa1_."Событие" in (1, 101, 105)
					and zaa1_."ТипЗадания" in ('073f1f97-c3d1-11e9-a20c-00155d03332b', '19f82228-6a30-11e8-9547-00155d03330d', 'ca94fa7f-6a2d-11e8-9547-00155d03330d', 'd34ca20c-3ab4-11ec-8f1b-00155d8ed20b', 'eb7e7aaf-b6dc-11eb-a262-00155dd2ff18', '0c31b207-257c-11ec-8efb-00155d8ed20b', 'f68b5287-e576-11e9-a211-00155d039a15','e4a53c12-cebf-11e9-a20f-00155d039a15','74a393f6-0bdc-11ed-8ff2-00155d8ed20b')
					and zdaa1_."Филиал" in (select faa1."Ссылка" from faa1)
			), 
	date_ as (
			--таблица для связки с датой других таблиц
			select 
			Date(date_trunc('day', zdaa1."Период")) as day_trunc,
			zdaa1."Период",
			zdaa1."ID"
			from zdaa1
			),
	_1_ as (
			--вывести ВСЕ поручения которые имеют событие 1, то есть начало
			select
			zdaa1."ID",
			zdaa1."Событие",
			max(zdaa1."Период") as date_1_ 
			from zdaa1 
			where zdaa1."Событие"=1 
			group by 1,2 
			), 
	_101_ as (
			--вывести ВСЕ поручения которые имеют событие 101, то есть сотрудник взял поручение в работу
			select
			zdaa1."ID",
			zdaa1."Событие",
			max(zdaa1."Период") as date_101_ 
			from zdaa1 
			where zdaa1."Событие"=101 
			group by 1,2 
			), 
	_105_ as (
			--вывести ВСЕ поручения которые имеют событие 105, то есть сотрудник выполнил поручение
			select distinct
			zdaa1."ID",
			zdaa1."Событие",
			zdaa1."Автор",
			zdaa1."Филиал",
			zdaa1."ТипЗадания",
			zdaa1."Документ",
			zdaa1."ИсточникСобытия",
			max(zdaa1."Период") as date_105_
			from zdaa1
			where zdaa1."Событие"=105
			group by 1,2,3,4,5,6,7
			),
	total as (
			--создание таблицы, где будут только поручения, имеющие события 1 101 105, то есть поручения, которые были успешно выполнены
			select distinct 
			_105_."Филиал" ,
			faa1."ПриписанК_Территории",
			_105_."Документ",
			_105_."ТипЗадания",
			_105_."ИсточникСобытия",
			date_.day_trunc,
			_105_."ID",
			_1_.date_1_,
			_101_.date_101_,
			_105_.date_105_,
			(_101_.date_101_-_1_.date_1_) as _1_101_date_diff_time,
			EXTRACT( EPOCH from _101_.date_101_-_1_.date_1_) as _1_101_date_diff_time_sec,
			(_105_.date_105_-_101_.date_101_) as _101_105_date_diff_time,
			EXTRACT( EPOCH from _105_.date_105_-_101_.date_101_) as _101_105_date_diff_time_sec,
			_105_."Автор"  
			from _105_
			inner join _101_ on _105_."ID"=_101_."ID"
			left join _1_ on _105_."ID"=_1_."ID"
			inner join date_ on _105_.date_105_=date_."Период"  
			inner join faa1 on _105_."Филиал"=faa1."Ссылка"
			/*ОГРАНИЧЕНИЯ ПО ВРЕМЕНИ ПОРУЧЕНИЯ
			 * 
			 * ДЛЯ ТИПОВ ЗАДАНИЙ 
			 * (a)
			 * СТОИТ ОГРАНИЧЕНИЕ ОТ 10 ДО 7200 СЕКУНД.
			 * И ДЛЯ РАЗНИЦЫ СОБЫТИЙ С 1 ПО 101, И ДЛЯ РАЗНИЦЫ ПО ВРЕМЕНИ В СОБЫТИЯХ 101 И 105.
			 * 
			 * ТО ЕСТЬ, ЕСЛИ РАЗНИЦА С 1 ПО 101 МЕНЬШЕ 10 СЕКУНД ИЛИ БОЛЬШЕ 7200 СЕКУНД
			 * ТО ЭТИ ДАННЫЕ НЕ БУДУТ УЧТЕНЫ, ДАЖЕ ЕСЛИ РАЗНИЦА С 101 ПО 105 БОЛЬШЕ 10 ИЛИ МЕНЬШЕ 7200.
			 * 101 БЕРЕТСЯ ПОСЛЕДНЕЕ, ТО, КОТОРОЕ ЗАВЕРШИТСЯ УСПЕШНО, ТО ЕСТЬ 105ТЫМ СОБЫТИЕМ
			 * 
			 * ДЛЯ ТИПОВ ЗАДАНИЙ (b)
			 * СТОИТ ОГРАНИЧЕНИЕ ОТ 10 ДО 32400 СЕКУНД.
			 * И ДЛЯ РАЗНИЦЫ СОБЫТИЙ С 1 ПО 101, И ДЛЯ РАЗНИЦЫ ПО ВРЕМЕНИ В СОБЫТИЯХ 101 И 105.
			 * 
			 * */
			where (
					
				  	(extract(EPOCH from _105_.date_105_-_101_.date_101_) between 10 and 7200
								and _105_."ТипЗадания" 
								in ('19f82228-6a30-11e8-9547-00155d03330d', 'ca94fa7f-6a2d-11e8-9547-00155d03330d',
								'd34ca20c-3ab4-11ec-8f1b-00155d8ed20b', '073f1f97-c3d1-11e9-a20c-00155d03332b') 
				  	)
				  -- можно убрать эту часть ниже, отмеченную, как "/**/", чтобы убрать ограничение с 1 по 101, отсюда
				  /**/and
				  /**/
				  /**/	(extract(EPOCH from _101_.date_101_-_1_.date_1_) between 10 and 7200
				  /**/			and _105_."ТипЗадания" 
				  /**/			in ('19f82228-6a30-11e8-9547-00155d03330d', 'ca94fa7f-6a2d-11e8-9547-00155d03330d',
				  /**/			'd34ca20c-3ab4-11ec-8f1b-00155d8ed20b', '073f1f97-c3d1-11e9-a20c-00155d03332b')		 
				  /**/	)
				  ) 
				  or
				  (
				  	(EXTRACT(EPOCH from _105_.date_105_-_101_.date_101_) < 32400 and _105_."ТипЗадания" 
				  			in ('eb7e7aaf-b6dc-11eb-a262-00155dd2ff18', '0c31b207-257c-11ec-8efb-00155d8ed20b', 'f68b5287-e576-11e9-a211-00155d039a15', 'e4a53c12-cebf-11e9-a20f-00155d039a15', '74a393f6-0bdc-11ed-8ff2-00155d8ed20b') 
				  	)
				  -- можно убрать эту часть ниже, отмеченную, как "/**/", чтобы убрать ограничение с 1 по 101 от сюда
				  /**/and
				  /**/
				  /**/	(EXTRACT(EPOCH from _101_.date_101_-_1_.date_1_) < 32400 and _105_."ТипЗадания" 
				  /**/			in ('eb7e7aaf-b6dc-11eb-a262-00155dd2ff18', '0c31b207-257c-11ec-8efb-00155d8ed20b', 'f68b5287-e576-11e9-a211-00155d039a15',
				  /**/	 		'e4a53c12-cebf-11e9-a20f-00155d039a15', '74a393f6-0bdc-11ed-8ff2-00155d8ed20b') 
				  /**/	)
				  )
				  and _105_.date_105_  > _101_.date_101_
				  and _101_.date_101_ > _1_.date_1_
			) 
select distinct 
	total.day_trunc as ДатаВыпПоручения,
	taa1."Наименование" as РРС,
	faa1."Наименование" as Филиал ,
	tzaa1."Наименование" as ТипЗадания,
	tzaa1."Код" as КодТипаЗадания ,
	(case
		when total."ИсточникСобытия" like '%websales%' then 'websales'
		when total."ИсточникСобытия" like '%mobile%' then 'mobile' 
		else total."ИсточникСобытия" 
	end) as ИсточникСобытия,
	author."_desc" as АвторСобытияВыпПоручения,
	--total."Автор" as АвторСобытияВыпПорученияGUID,
	total.date_1_ as ДатаСобытия1,
	total.date_101_ as ДатаСобытия101,
	total.date_105_ as ДатаСобытия105,
	total._1_101_date_diff_time_sec as _1_101_ВремяВыпПорученияСекунд,
	total._1_101_date_diff_time as _1_101_ВремяВыпПоручения,
	total._101_105_date_diff_time_sec as _101_105_ВремяВыпПорученияСекунд,
	total._101_105_date_diff_time as _101_105_ВремяВыпПоручения,
	total."ID" as ID,
	total."Документ" as ДокументGUID
from
	total
inner join (
	select
		"Ссылка",
		"Наименование"
	from
		"DB_1"."S.taa1"
	where
		"Ссылка" in ('47449ffc-7ca8-11e5-a729-00155d03361b' , '794dd148-409b-11e1-8064-001517c526f0' , '312873ac-708d-11e5-9610-00155d03361b',
        		'4979cede-2660-11e7-ab3b-00155d03330d', 'b80e971f-f028-11e2-80d0-00155d030b1f', 'b10b3c28-f137-11e9-a20d-00155d03332b', '894248bc-8246-11e2-92a8-00155d030b1f') ) as taa1
        	on
	total."ПриписанК_Территории" = taa1."Ссылка"
inner join (
	select
		"Ссылка",
		"Наименование",
		"Код"
	from
		"DB_1"."S.tzaa1"
	where
		"Ссылка" in ( 'd34ca20c-3ab4-11ec-8f1b-00155d8ed20b' , 'ca94fa7f-6a2d-11e8-9547-00155d03330d', 'e4a53c12-cebf-11e9-a20f-00155d039a15',
			'f68b5287-e576-11e9-a211-00155d039a15', '073f1f97-c3d1-11e9-a20c-00155d03332b', '19f82228-6a30-11e8-9547-00155d03330d',
			'0c31b207-257c-11ec-8efb-00155d8ed20b', '74a393f6-0bdc-11ed-8ff2-00155d8ed20b', 'eb7e7aaf-b6dc-11eb-a262-00155dd2ff18') 
	    ) as tzaa1
		on
	total."ТипЗадания" = tzaa1."Ссылка"
inner join 
	faa1
		on
	total."Филиал" = faa1."Ссылка"
inner join (
	select
		"_IDRRef",
		"_desc"
	from
		"DB_1"."dbo._R17") as author
			on
	total."Автор" = author."_IDRRef" 
	/*	проверка по дням и документу
	where (total.day_trunc = '2023-04-06') AND (total."Документ" = '5d30f11a-9ba6-4202-b8a2-bba7d752b01c')*/
	group by 16,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
order by "_101_105_ВремяВыпПорученияСекунд" desc, "_1_101_ВремяВыпПорученияСекунд" desc 